//countData.js
import React, { PropTypes } from 'react';

function countObj(){
return {
	"美国":{
		"2":["9年级","10年级"],
		"3":["10年级","11年级"],
		"4":["11年级","社区学院"],
		"5":["本科双录取","本科直录","社区学院","文理学院"],
		"6":["本科双录取","本科直录","社区学院","文理学院"],
		"7":["本科双录取","本科直录","社区学院","文理学院"],
		"8":["转学分就读本科","本科双录取","本科直录"],
		"9":["转学分就读本科","本科双录取","本科直录"],
		"10":["本科双录取","本科直录","社区学院","文理学院"],
		"11":["转学分就读本科","本科双录取","本科直录"],
		"12":["转学分就读本科"],
		"13":["硕士双录取","硕士直录"],
		"14":["硕士双录取","硕士直录","博士课程"]
	  },
	"英国":{
		"2":["Pre-A level 或者IGCSE","GCSE"],
		"3":["A-level","Pre-A level 或者IGCSE"],
		"4":["本科预科课程","A-level","本科快捷课程"],
		"5":["本科预科课程","本科快捷课程","A-level"],
		"6":["本科预科课程","本科快捷课程","本科一年级课程"],
		"7":["本科快捷课程","本科预科课程","本科一年级课程"],
		"8":["硕士预科","top-up 课程","插读本科大二"],
		"9":["硕士"],
		"10":["本科快捷课程","本科预科课程","本科一年级课程"],
		"11":["本科快捷课程","本科一年级课程"],
		"12":["top-up 课程","硕士预科"],
		"13":["硕士","硕士预科"],
		"14":["硕士"]
	  },
	"澳洲":{
		"2":["10年级"],
		"3":["10年级","11年级"],
		"4":["本科预科课程","11年级"],
		"5":["本科快捷课程","本科预科课程","本科一年级课程（仅限应届毕业生）"],
		"6":["本科快捷课程","本科预科课程","本科一年级课程"],
		"7":["本科快捷课程","转学分就读本科","本科预科课程"],
		"8":["硕士","硕士预科","转学分就读本科"],
		"9":["硕士","硕士预科","转学分本科"],
		"10":["本科一年级课程","本科快捷课程","本科预科课程"],
		"11":["转学分就读本科","本科快捷课程","本科预科课程"],
		"12":["转学分就读本科","硕士预科"],
		"13":["硕士","硕士预科"],
		"14":["硕士"]
	  },
	"日本":{
		"2":["10年级"],
		"3":["10年级","11年级"],
		"4":["11年级","12年级"],
		"5":["语言+本科","专门学校"],
		"6":["语言+本科","专门学校"],
		"7":["语言+本科","语言+三年级编入","专门学校"],
		"8":["硕士","语言+硕士","语言+三年级编入","专门学校"],
		"9":["硕士","语言+硕士","语言+三年级编入","专门学校"],
		"10":["语言+本科","专门学校"],
		"11":["语言+本科","语言+三年级编入","专门学校"],
		"12":["语言+三年级编入","专门学校"],
		"13":["语言+就业","语言+硕士","语言+硕士预科（研究生）","硕士","硕士预科（研究生）"],
		"14":["语言+就业","语言+硕士","语言+硕士预科（研究生）","硕士","硕士预科（研究生）","专门学校"]
	  }
};
}

function countTabObj(){
return {
	"美国":{
		"9年级":["可以更好地融入当地的学习环境，以当地高中生的身份申请大学有优势","入学需面试，提供托福或SLEP、SSAT等成绩，学习压力较大"],
		"10年级":["可以更好地融入当地的学习环境，以当地高中生的身份申请大学有优势","入学需面试，提供托福或SLEP、SSAT等成绩，学习压力较大"],
		"11年级":["优质教育资源，课程丰富，授课方式灵活","入学需面试，提供托福或SLEP等成绩，过渡时间较短，不利于将来的本科申请"],
		"本科双录取":["入学要求适当放低，部分项目语言成绩（托福或雅思）和标准化考试成绩（SAT、ACT等）较低就可入学，个别项目甚至没有语言成绩和标准化考试成绩要求","可选学校相对较少，一般都会有衔接课程。入学要求越低，衔接课程越长"],
		"本科直录":["教育质量和文凭含金量高，认可度高","名校竞争激烈；普通大学数量庞大，选校不容易"],
		"社区学院":["学费低，录取灵活且接受双录取，将来转入名校的机会大","如果不能转入上一级学校的话，只能获得副学士文凭"],
		"文理学院":["小班教学，精英教育","和综合性大学相比，学校规模较小，开设的专业较少，以文科、商科为主"],
		"转学分就读本科":["可以直接转入本科学习","选校范围受到限制，转学分有不确定性"],
		"硕士双录取":["入学要求适当放低，部分项目语言成绩（托福或雅思）和标准化考试成绩（GMAT或GRE，LSAT等）较低就可入学，个别项目甚至没有语言成绩和标准化考试成绩要求","可选学校相对较少，一般都会有衔接课程。入学要求越低，衔接课程越长"],
		"硕士直录":["教育质量和文凭含金量高，认可度高","名校竞争激烈；普通大学数量庞大，选校不容易"],
		"博士课程":["基本上全额奖学金，自己花费很少","学校对学生的各项要求很高，竞争激烈"]
	  },
	"英国":{
		"Pre-A level 或者IGCSE":["帮助学生顺利过渡到A-level课程的学习，时间短，学习压力小","中国学生较多，不利于融入当地文化；可选科目较少"],
		"GCSE":["可以更好地融入当地的学习环境，以当地高中生的身份申请大学有优势","费用高，名额有限，需要较强的独立自理能力"],
		"A-level":["可根据兴趣选择科目，读完直接申本科，申到英国名校机会大","费用高，学习压力较大"],
		"本科预科课程":["为本科做语言和学习的准备，更快适应本科课程，升入名校几率大","部分名校不接受预科毕业生"],
		"本科快捷课程":["毕业后可插读英国本二，节省时间和费用","学校选择面窄"],
		"本科一年级课程":["教育质量一流、严谨；学制短，申请硕士更有竞争力","要求较高，学习压力大"],
		"硕士预科":["过渡到硕士课程的跳板，更好适应硕士课程，申请要求低","个别名校不接受预科毕业生"],
		"top-up 课程":["接受学生范围广，一年即可拿到英国学士学位","专业选择较少"],
		"插读本科大二":["教育质量一流、严谨；节省时间","要求较高，学习压力大"],
		"硕士":["学制短，费用低，教育质量和文凭含金量高，认可度高","假期少，压力较大"],
		"硕士预科":["过渡到硕士课程的跳板，更好适应硕士课程，申请要求低","个别名校不接受预科毕业生"]
	},
	"澳洲":{
		"10年级":["优质教育资源，课程丰富，授课方式灵活，升学压力小","对孩子独立自主能力要求较高"],
		"11年级":["优质教育资源，课程丰富，授课方式灵活，升学压力小","对孩子独立自主能力要求较高"],
		"本科预科课程":["专业设置丰富，缓冲入读本科的学习压力","时间长，花费多"],
		"本科快捷课程":["可直升本二，时间短，花费少，专业设置灵活","学校选择面小，比较适合适应能力强、英语基础较好的学生"],
		"本科一年级课程（仅限应届毕业生）":["部分大学认可高考成绩，雅思要求较低","高考成绩要求较高"],
		"转学分就读本科":["可以直接转入澳洲本科学习","时间长，申请流程非常复杂"],
		"硕士":["教育质量高，为移民提供有利条件","学习压力较大"],
		"硕士双录取":["",""],
		"硕士直录":["",""],
		"转学分本科":["可以直接转入澳洲本科学习","时间长，申请流程非常复杂"],
		"本科一年级课程":["部分大学认可高考成绩，雅思要求较低","高考成绩要求较高"],
		"硕士预科":["为申请硕士课程做语言和学习上的缓冲","毕业后可选择学校少"]
	},
	"日本":{
		"10年级":["参加日本学生的高考，升学压力小","一般要求国内高一在读才可以申请，对孩子独立自主能力要求较高"],
		"11年级":["参加日本学生的高考，升学压力小","对孩子独立自主能力要求较高，学校选择少"],
		"12年级":["在日本高中准备留学生高考（EJU）","日语2级，必须可以拿到中国的高中毕业生证书，学校选择少"],
		"语言+本科":["在语言学校准备日本留学生高考（EJU），进入名校的机会比国内高","语言学校的备考周期在半年到一年"],
		"专门学校":["日语2级即可入学，没有日语成绩，可以先去日语学校过渡。日本的很多职业类专业如动漫、声优、舞蹈、音乐、游戏设计、美容美发、宠物护理等均以专门学校为主，学制2年和4年","纯粹是为了学习一门自己喜欢的技术，日本每年也有10"],
		"语言+三年级编入":["至少在国内完成两年大学课程，直接进入日本大学本科三年级就读","至少要在语言学校学习半年，在日本本土申请，学校可选范围有限制"],
		"硕士":["在国内可以直接安排硕士入学考试","私立大学，可选择的学校为个位数"],
		"语言+硕士":["通过语言学校过渡，备考充分，免去考试奔波","至少要在语言学校学习半年，需通过大学考前资格审核"],
		"语言+就业":["在语言学校学习就职课程，通过直接在日本就业","必须有学位，日语至少2级水平"],
		"语言+硕士预科（研究生）":["在日本联系导师更方便，可以转专业，申请入学制","进入硕士课程仍需通过大学考试"],
		"硕士预科（研究生）":["无需考试，可以在国内直接申请入学","联系导师比较复杂，不能转专业，进入硕士课程仍需通过大学考试"]
	}
};
}

export default { countObj,countTabObj};
/*xyx 2015.10.10*/

