//USAAreaData.js

function getAreaData(){
	return {
                "西北地区":"华盛顿州、俄勒冈州、爱达荷州、蒙大拿州、怀俄明州",
                "加州、内华达州":"内华达州、加利福尼亚州",
                "西南地区":"科罗拉多州、新墨西哥州、亚利桑那州、犹他州",
                "五大湖地区":"明尼苏达州、威斯康星州、伊利诺州、密执安州、印地安那州、俄亥俄州",
                "大平原地区":"北达科他州、南达科他州、内布拉斯加州、堪萨斯州、俄克拉荷马州、德克萨斯州",
                "密西西比河流域":"密苏里州、密西西比州、肯塔基州、田纳西州、阿肯色州、路易斯安那州、亚拉巴马州",
                "东北地区":"缅因州、佛蒙特州、新罕布什尔州、马萨诸塞州、康涅狄格州、纽约州、罗得岛州、新泽西州、宾夕法尼亚州",
                "东南地区":"西弗吉尼亚州、弗吉尼亚州、北卡罗来纳州、南卡罗来纳州、乔治亚州、佛罗里达州、夏威夷州、阿拉斯加州"
            };
}

export default{getAreaData};

